/*
#  DESCRIPTION: 
#
#      OPTIONS: ---
# REQUIREMENTS: ---
#         BUGS: ---
#        NOTES: ---
#       AUTHOR: li.zhanlei@h3c.com
#      COMPANY: h3c.bigdata
#      VERSION: 1.0
#      CREATED: 2017/06/30
#     REVIEWER:
#     REVISION: ---
*/
set names utf8;
use fdm;
DROP TABLE IF EXISTS `edu_hb_zgyz`;
CREATE TABLE "edu_hb_zgyz" (
  "DM" char(3) NOT NULL COMMENT '代码',
  "MC" varchar(20) NOT NULL COMMENT '名称',
  "ZMDM" char(2) NOT NULL COMMENT '字母代码'
) ENGINE=EXPRESS DEFAULT CHARSET=utf8 ;
-- ----------------------------
-- Records of edu_dim_dw
-- ----------------------------
insert into edu_hb_zgyz values ('111','塔吉克语','tg'),
('161','塔塔尔语','tt'),
('162','柯尔克孜语','ky'),
('163','哈萨克语','kk'),
('168','乌孜别克语','uz'),
('211','汉语（中文）','zh'),
('212','傣语','th'),
('215','藏语','bo'),
('217','朝鲜语','hn'),
('222','蒙古语','mn'),
('223','维吾尔语','ug'),
('224','壮语','za'),
('501','裕固语','yg'),
('506','保安语','bk'),
('507','达斡尔语','du'),
('508','东乡语','dx'),
('509','土语','tu'),
('513','鄂伦春语','ol'),
('514','鄂温克语','ew'),
('517','赫哲语','hz'),
('518','满语','me'),
('519','锡伯语','xb'),
('524','撒拉语','sh'),
('531','瑶语','ya'),
('532','仡佬语','ge'),
('533','京语','gi'),
('536','阿昌语','ac'),
('537','独龙语','dr'),
('538','基诺语','jn'),
('539','珞巴语','lb'),
('540','门巴语','mb'),
('541','怒语','nu'),
('542','普米语','pm'),
('543','羌语','qi'),
('544','土家语','tj'),
('548','景颇语','jp'),
('551','白语','bi'),
('552','哈尼语','ho'),
('553','拉祜语','lh'),
('554','傈僳语','ls'),
('555','纳西语','nx'),
('556','彝语','yi'),
('563','黎语','li'),
('567','侗语','do'),
('568','仫佬语','mm'),
('569','毛难语','mu'),
('570','水语','sy'),
('574','布依语','by'),
('580','苗语','mh'),
('584','崩龙语','bb'),
('585','布朗语','bl'),
('586','佤语','va'),
('590','高山语','gs'),
('061','俄语','ru');
