/*
#  DESCRIPTION: 
#
#      OPTIONS: ---
# REQUIREMENTS: ---
#         BUGS: ---
#        NOTES: ---
#       AUTHOR: li.zhanlei@h3c.com
#      COMPANY: h3c.bigdata
#      VERSION: 1.0
#      CREATED: 2017/06/30
#     REVIEWER:
#     REVISION: ---
*/
set names utf8;
use fdm;
DROP TABLE IF EXISTS `edu_hb_xklb`;
CREATE TABLE "edu_hb_xklb" (
  "DM" varchar(10) NOT NULL COMMENT '代码',
  "MC" varchar(40) NOT NULL COMMENT '名称'
) ENGINE=EXPRESS DEFAULT CHARSET=utf8 ;

-- ----------------------------
-- Records of edu_dim_dw
-- ----------------------------
insert into edu_hb_xklb values ('110','数学'),
('120','信息科学与系统科学'),
('130','力学'),
('140','物理学'),
('150','化学'),
('160','天文学'),
('170','地球科学'),
('180','生物学'),
('190','心理学'),
('210','农学'),
('220','林学'),
('230','畜牧、兽医科学'),
('240','水产学'),
('310','基础医学'),
('320','临床医学'),
('330','预防医学与公共卫生学'),
('340','军事医学与特种医学'),
('350','药学'),
('360','中医学与中药学'),
('410','工程与技术科学基础学科'),
('413','信息与系统科学相关工程与技术'),
('416','自然科学相关工程与技术'),
('420','测绘科学技术'),
('430','材料科学'),
('440','矿山工程技术'),
('450','冶金工程技术'),
('460','机械工程'),
('470','动力与电气工程'),
('480','能源科学技术'),
('490','核工程技术'),
('510','电子与通信技术'),
('520','计算机科学技术'),
('530','化学工程'),
('535','产品应用相关工程与技术'),
('540','纺织科学技术'),
('550','食品科学技术'),
('560','土木建筑工程'),
('570','水利工程'),
('580','交通运输工程'),
('590','航空、航天科学技术'),
('610','环境科学技术及资源科学技术'),
('620','安全科学技术'),
('630','管理学'),
('710','马克思主义'),
('720','哲学'),
('730','宗教学'),
('740','语言学'),
('750','文学'),
('760','艺术学'),
('770','历史学'),
('780','考古学'),
('790','经济学'),
('810','政治学'),
('820','法学'),
('830','军事学'),
('840','社会学'),
('850','民族学与文化学'),
('860','新闻学与传播学'),
('870','图书馆、情报与文献学'),
('880','教育学'),
('890','体育科学'),
('910','统计学');
